backend/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
    def index
        render json: Question.all, status: :ok

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        question = Question.find(params[:id])

INSERT INTO "questions" ("category", "question", "difficulty", "correct_answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        q = Question.create(question_params)