backend/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users"
---
    def index
      render json: User.all, status: 200

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      user = User.find(session[:user_id])